espressif/esp-video-components/esp_video/test_apps/posix/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_VFS_MAX_COUNT=16
CONFIG_CAMERA_BF3925=y
CONFIG_CAMERA_BF3A03=y
CONFIG_CAMERA_GC0308=y
CONFIG_CAMERA_GC2145=y
CONFIG_CAMERA_OV2640=y
CONFIG_CAMERA_OV2710=y
CONFIG_CAMERA_OV5645=y
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_SC030IOT=y
CONFIG_CAMERA_SC035HGS=y
CONFIG_CAMERA_SC101IOT=y
CONFIG_CAMERA_SC202CS=y
CONFIG_CAMERA_SC2336=y
CONFIG_CAM_MOTOR_DW9714=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ISP_PIPELINE_CONTROLLER_TASK_STACK_USE_PSRAM=y
CONFIG_ESP_VIDEO_ENABLE_SWAP_SHORT_PERF_LOG=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
